import React from 'react'
import { Link } from 'react-router-dom'

const Signup = () => {
	return (
		<div className='container'>
			<div className='my-32 flex items-center justify-between'>
				<div
					data-aos='fade-down-right'
					className='w-[794px] h-[512px] bg-[#F2FAFB] flex items-center justify-center flex-col gap-5 text-center'
				>
					<svg
						width='64'
						height='64'
						viewBox='0 0 64 64'
						fill='none'
						xmlns='http://www.w3.org/2000/svg'
					>
						<path
							d='M49.8566 62.1243H5.7243C4.8613 62.1243 4.15918 61.4222 4.15918 60.5593V35.1738C4.15918 34.6561 3.73955 34.2363 3.22168 34.2363C2.7038 34.2363 2.28418 34.6561 2.28418 35.1738V60.5593C2.28418 62.4562 3.82743 63.9993 5.7243 63.9993H49.8566C50.3744 63.9993 50.7941 63.5796 50.7941 63.0618C50.7941 62.5441 50.3743 62.1243 49.8566 62.1243Z'
							fill='#2CB2BB'
						/>
						<path
							d='M23.5306 31.1769C23.6923 31.486 24.0123 31.6798 24.3613 31.6798H58.2772C59.1401 31.6798 59.8422 32.3819 59.8422 33.2449V60.56C59.8422 61.4229 59.1402 62.125 58.2772 62.125H54.2316C53.7137 62.125 53.2941 62.5448 53.2941 63.0625C53.2941 63.5802 53.7137 64 54.2316 64H58.2772C60.1741 64 61.7172 62.4569 61.7172 60.56V33.2448C61.7172 31.3479 60.1741 29.8046 58.2772 29.8046H55.5142V15.8664C55.5142 15.6274 55.4211 15.3849 55.2397 15.2035L49.8958 9.85962V2.81437C49.8958 1.2625 48.6333 0 47.0814 0H10.5358C8.98393 0 7.72155 1.2625 7.72155 2.81437V23.601H5.09855C3.54668 23.601 2.28418 24.8635 2.28418 26.4154V30.7855C2.28418 31.3032 2.7038 31.723 3.22168 31.723C3.73955 31.723 4.15918 31.3032 4.15918 30.7855V26.4154C4.15918 25.8974 4.58055 25.476 5.09855 25.476H19.9791C20.3298 25.476 20.6487 25.669 20.8113 25.9799C22.0514 28.3499 22.3267 28.876 23.5306 31.1769ZM44.7737 7.389C45.6402 8.2555 51.1428 13.7581 52.3134 14.9288H46.4306C45.5169 14.9288 44.7737 14.1855 44.7737 13.2719V7.389ZM9.59655 2.81437C9.59655 2.29637 10.0179 1.875 10.5359 1.875H47.0814C47.5996 1.875 48.0209 2.29637 48.0209 2.81437V7.9845L44.4992 4.46275C44.3332 4.29675 44.0939 4.18813 43.8362 4.18813H17.7372C15.7897 4.18813 14.2053 5.7725 14.2053 7.72V23.601H9.59655V2.81437ZM24.9288 29.8048L23.9601 27.9533H48.4053C48.9232 27.9533 49.3428 27.5335 49.3428 27.0158C49.3428 26.498 48.9232 26.0783 48.4053 26.0783H22.9791L22.4728 25.1106C21.9857 24.1795 21.0301 23.601 19.9792 23.601H16.0804V7.72013C16.0804 6.8065 16.8237 6.06325 17.7373 6.06325H42.8988V13.272C42.8988 15.2195 44.4832 16.8039 46.4307 16.8039H53.6394V29.8048H24.9288Z'
							fill='#2CB2BB'
						/>
						<path
							d='M48.4051 19.8691H21.4238C20.906 19.8691 20.4863 20.2889 20.4863 20.8066C20.4863 21.3244 20.906 21.7441 21.4238 21.7441H48.4051C48.923 21.7441 49.3426 21.3244 49.3426 20.8066C49.3426 20.2889 48.923 19.8691 48.4051 19.8691Z'
							fill='#2CB2BB'
						/>
					</svg>
					<h1 className='font-bold text-2xl text-[#253F41]'>
						На что стоит обращать внимание <br /> при выборе клиники
					</h1>
					<p className='text-[#253F41] text-sm font-medium'>
						Здесь очень много критериев, поэтому мы написали <br /> отдельную
						статью с ответами на этот вопрос
					</p>
					<Link
						onClick={() => {
							window.scrollTo(0, 0)
						}}
						to='/news'
						className='w-[256px] h-[50px] flex items-center justify-center text-white font-bold bg-[#2CB2BB] rounded-sm'
					>
						Читать статью
					</Link>
				</div>
				<div
					data-aos='fade-down-left'
					className='w-[386px] h-[512px] bg-[#2CB2BB] text-center flex items-center justify-center flex-col gap-3'
				>
					<h1 className='text-[28px] text-white font-bold'>
						Запись <br /> на консультацию
					</h1>
					<p className='text-white'>
						Не откладывайте, запишитесь <br /> на консультацию прямо сейчас,{' '}
						<br /> перезвоним через 15 минут
					</p>
					<input
						className='w-[346px] rounded-sm h-[55px] bg-[white] px-5 font-bold text-sm text-gray-500'
						type='text'
						placeholder='Имя'
					/>
					<input
						className='w-[346px] rounded-sm h-[55px] bg-[white] px-5 font-bold text-sm'
						type='text'
						placeholder='Мобильный телефон'
					/>
					<button className='w-[346px] h-[50px] text-[#2CB2BB] font-bold bg-[white] text-sm  rounded-sm'>
						Записаться
					</button>
				</div>
			</div>
		</div>
	)
}

export default Signup
